# RDBMS and SQL

Complete the tasks listed below. You can submit the completed lab until 11:59 PM in the night.

<u>Requirement:</u><br>
Do your best to write Pythonic code instead of the traditional programming code.

### Task 1 (2 marks)

Connect to the supplied database __petsDB__, and write a function named __is_open__ to check if the connection is open or closed. The function, when called, should return either True or False depending upon whether the connection to the database is open or closed. The output in the two cases should look as follows:

True

Connection closed. Cannot operate on a closed database.<br>False

<u>Hint:</u> Use __try__ and __except__ along with the exception error `sqlite3.ProgrammingError` in conjunction with __except__.

In [1]:
### Write your code below this comment.
import sqlite3
conn = sqlite3.connect("petsdb")

In [2]:
#Define a is_open on connectivity test
def is_open(conn):
    try:
        #select 1 row from persons table
        conn.execute("Select 1 From persons")
        return True
    #define exception handling
    except sqlite3.ProgrammingError as err:
        print("Connection closed ()".format(err))
        return False
print(is_open(conn))

True

In [3]:
conn.close()

In [4]:
print(is_open(conn))

Connection closed ()
False

### Task 2 (2 marks)

Now connect to the provided database __petsDB__ once again and retrieve the names of all the tables from the database as a list of tuples. Also retrieve the column names for all the tables as a list of strings. The outputs should look as follows respectively:

    The names of the tables in the database are as follows:

    [('persons',), ('pets',)]

    The names of the columns in the table 'persons' are as follows:

    ['Id', 'First Name', 'Last Name', 'Age', 'City', 'Zip Code']:

    The first 5 rows in the table 'persons' are as follows:
    
    [(1, 'Erica', None, 22, 'south port', 2345678),
     (2, 'Jordi', None, 73, 'east port', 123456),
     (3, 'Chasity', None, 70, 'new port', 76856785),
     (4, 'Gregg', None, 31, 'new port', 76856785),
     (5, 'Tony', 'Lindgren', 7, 'west port', 2345678)]
     
    The names of the columns in the table 'pets' are as follows:

    ['Owner Id', 'Pet Name', 'Pet Type', 'Treatment Done']:

    The first 5 rows in the table 'pets' are as follows:
    
    [(57, 'mani', 1.0, 0),
     (80, 'tamari', None, 0),
     (25, 'raba', None, 0),
     (27, 'olga', None, 0),
     (60, 'raba', None, 0)]

<u>Hint:</u> Use __sqlite_master WHERE__ ... You would also need to use list comprehension along with the string __join__ method and __map__ function so that the names of columns ('Id', 'First Name' etc) are in title case and separated by a space instead of lower case and separated by hyphens (which is the case with the names coming from the database).

In [5]:
### Write your code below this comment.
conn = sqlite3.connect("petsdb")
cursor = conn.cursor()

In [6]:
#Table Name handling
print("The names of the tables in the database are as follows:")
cursor.execute("select tbl_name from sqlite_master where type='table';")
print(cursor.fetchall())

The names of the tables in the database are as follows:
[('persons',), ('pets',)]

In [7]:
#Person table
print("The names of the columns in the table 'persons' are as follows:")

tblPersons = cursor.execute("SELECT * FROM persons limit 5")
tblPersonCol = list(map(lambda x: x[0].title().replace('_',' '), cursor.description))    
print(tblPersonCol)

The names of the columns in the table 'persons' are as follows:
['Id', 'First Name', 'Last Name', 'Age', 'City', 'Zip Code']

In [8]:
print("The first 5 rows in the table 'persons' are as follows:")
tblPersons.fetchall()

The first 5 rows in the table 'persons' are as follows:

[(1, 'Erica', None, 22, 'south port', 2345678),
 (2, 'Jordi', None, 73, 'east port', 123456),
 (3, 'Chasity', None, 70, 'new port', 76856785),
 (4, 'Gregg', None, 31, 'new port', 76856785),
 (5, 'Tony', 'Lindgren', 7, 'west port', 2345678)]

In [9]:
#Pet table
print("The names of the columns in the table 'pets' are as follows:")

tblPets = cursor.execute("SELECT * FROM pets limit 5")
tblPetsCol = list(map(lambda x: x[0].title().replace('_',' '), cursor.description))    
print(tblPetsCol)

The names of the columns in the table 'pets' are as follows:
['Owner Id', 'Pet Name', 'Pet Type', 'Treatment Done']

In [10]:
print("The first 5 rows in the table 'pets' are as follows:")
tblPets.fetchall()

The first 5 rows in the table 'pets' are as follows:

[(57, 'mani', 1.0, 0),
 (80, 'tamari', None, 0),
 (25, 'raba', None, 0),
 (27, 'olga', None, 0),
 (60, 'raba', None, 0)]

### Task 3 (2 marks)

Now transform the tables __persons__ and __pets__ into two Dataframes named __df_persons__ and __df_pets__ respectively, so that you can go ahead with the tasks to follow.

In [18]:
### Write your code below this comment.
import pandas as pd
columns = ["ID", "First Name", "Last Name", "Age", "City", "Zip Code"]
data = []
sql = """SELECT * FROM persons"""
persons = cursor.execute(sql)

for row in persons:
    data.append(row)
    
df_persons = pd.DataFrame(data, columns=columns)
df_persons.head()

   ID First Name Last Name  Age        City  Zip Code
0   1      Erica      None   22  south port   2345678
1   2      Jordi      None   73   east port    123456
2   3    Chasity      None   70    new port  76856785
3   4      Gregg      None   31    new port  76856785
4   5       Tony  Lindgren    7   west port   2345678

In [17]:
### Write your code below this comment.
import pandas as pd 
columns = ["Owner Id", "Pet Name", "Pet Type", "Treatment Done"]
data = []
sql = """SELECT * FROM pets"""
persons = cursor.execute(sql)

for row in persons:
    data.append(row)
    
df_pets = pd.DataFrame(data, columns=columns)
df_pets.head()

   Owner Id Pet Name  Pet Type  Treatment Done
0        57     mani       1.0               0
1        80   tamari       NaN               0
2        25     raba       NaN               0
3        27     olga       NaN               0
4        60     raba       NaN               0

### Task 4 (2 marks)

Consider the following question:

__What are counts for each unique age group in the persons database?__

Answer this question using a SQL query from the database (save it as __sql_4__) as well as using the Dataframe __df_persons__ you created in Task 3 above.

The SQL query should return a list of tuples named __rows__ which you should then use to create a Dataframe named __df_sql__ with an index column named `'Age'` and another column named `'Counts'`. The Dataframe should look as follows:

<img align=left src="images/df_sql_res4.png" height="105" width="105">

Similarly, also use methods from __pandas__ in conjunction with the Dataframe __df_persons__ to mimic your SQL query and create another Dataframe named __df_pd__ which looks exactly the same as the Dataframe __df_sql__ shown above.

In [13]:
### Write your code below this comment.
import pandas as pd

colName = ["Age", "Counts"]
tupleAge = []
sql_4 = "select age, count(*) from persons group by age"

for r in cursor.execute(sql_4):
    tupleAge.append(r)

df_sql = pd.DataFrame(tupleAge, columns = colName)
df_sql.set_index('Age').head(5)

     Counts
Age
5         2
6         1
7         1
8         3
9         1

In [14]:
df_pd=df_persons.Age.value_counts().reset_index(
    name='Counts').rename(columns={'index': 'Age', 1: 'Counts'}
                         ).sort_values(by = 'Age', ascending = True)
df_pd.set_index('Age').head()

     Counts
Age
5         2
6         1
7         1
8         3
9         1

Now answer the following question:

What similarities / differences did you find between the SQL query you wrote and saved as __sql_4__ and the code you used to create the Dataframe __df_pd__?

__Answer__: 
What I found simliar as both results are group by age and count.
The difference is sql statement be more direct use of variables Age and count, while panda can provide more features (transform, aggregrate and sort) from the dataframe.

### Task 5 (2 marks)

Consider the following question:

__How many pets are there from the city called "east port"?__

Answer this question using a SQL query from the database (save it as __sql_5__). Also use methods from __pandas__ in conjunction with the Dataframes __df_persons__ and __df_pets__ you created in Task 3 above to mimic your SQL query. Save the joined Dataframe as __df_pd_join__.

In both cases, the output is a number.

In [22]:
### Write your code below this comment.
sql ="Select count(*) from pets join persons on pets.owner_id = persons.id where persons.city='east port'"
sql_5 = cursor.execute(sql)
sql_5.fetchall()

[(49,)]

Now answer the following question:

What similarities / differences did you find between the SQL query you wrote and saved as __sql_5__ and the code you used to create the Dataframe __df_pd_join__?

In [23]:
df_pd_join = pd.merge(df_persons, df_pets, how="inner", left_on='ID',right_on='Owner Id')
pets_count = (df_pd_join.loc[df_pd_join['City'] == 'east port'])
pets_count['ID'].count()

49

__Answer__: What I found similar was both method are using the same joining method and achieve the same results